Tekla Open API Reference for Tekla Structures 2025
FinishItem Constructor
 Creates a new finish item instance.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public FinishItem(
	string abbreviation,
	string description
)
Public Sub New (
	abbreviation As String,
	description As String
)
Parameters
abbreviation
Type: System.String
[Missing <param name="abbreviation"/> documentation for "M:Tekla.Structures.Catalogs.FinishItem.#ctor(System.String,System.String)"]
description
Type: System.String
[Missing <param name="description"/> documentation for "M:Tekla.Structures.Catalogs.FinishItem.#ctor(System.String,System.String)"]
See Also
Reference
FinishItem Structure
Tekla.Structures.Catalogs Namespace